content/JRL/Dating_Openly_Challanges.md
+++
title = "Poly Dating"
author = ["Josh Rollins"]
publishDate = 2018-11-14T00:00:00-05:00
lastmod = 2019-02-26T08:39:11-05:00
draft = true
+++

So, you've discovered it exists and people are calling it "poly," short for polyamourous. Not so fast dude! There are a few things you should know.

So, you've discovered it exists and people are calling it "poly," short for polyamourous. Not so fast dude! There are a few things you should know.


## It Doesn't Get Easier {#it-doesn-t-get-easier}

Women living a healthy polyamorous lifestyle after 35 are not exactly common compared to women in their 20s and even early 30s. Most women after 35 are looking for something "serious" and "long lasting," which usually means a monogamous long-term relationship that would at least lead in the direction of marriage.

People also get generally more busy after 35. Work takes a large chunk of time, and by this point you'd have an idea of what you like to do and enjoy putting time into it. People who are passionate about what they do is important in dating, as you'd find out. You better stay away from the bitter ones who suck your life energy away, and they in turn will also stay away from you if you're bitter. This will make things more challanging as you get to know someone and want to spend more time with them (and hopefully, them with you). Work and other life aspect often get in the way, and juggling more than one relationship multiply the difficulty level at least by two.


## The Mainstream {#the-mainstream}

Polyamory is a common term now and it's being thrown around without care. At one time, you got the stage to discuss what polyamory means to you as a person over coffee with a facinated date who would look at you wide-eye. Now you find that the person at the other side of the table, who sometimes never paracticed polyamory, already knows what polyamory is and will explain its mean to _you_. It doesn't matter that your version is different or that their idea is full of pop-colutre references they picked up from their good friend Ashley; their version is the right version and that's that.


## Physical Attraction {#physical-attraction}

People don't usually get more physically attractive as they get older. It's funny, how far folks go out of their way sometimes not to mention that they don't find you attractive. You'd find that the truth burns much less as you get older, and that you appriciate the honesty and the quick treatment much more than polite ghosting.

Look, Fact is you're not a super model. I'm not saying you're ugly, because you're not, and many _will_ find you attractive. All I'm saying is, know your comptition. Where most popular dating apps and events in real life have a 10:1 ration of man to availble women, each women has options, and those option would often lean toward younger, toner, sexier. Can you blame them? Try not to take it personally and move on.

The other side of the coin is this: don't settle for women you don't find attractive - and notice I said attractive, not physically attractive. That's a fine line to walk. You can take a certain "hit" in physical attractiveness if someone is otherwise funny, fun, sexy, good, etc. But only that much if we assume you're still interested in sex. And don't feel bad about it either. We live in a country where obsidity is not just an epedemic, it's also sometimes justified (not medically speaking) and god help you if you speak against it. There's the [WHO's BMI calculations](http://www.who.int/en/news-room/fact-sheets/detail/obesity-and-overweight) which are pretty good at giving you an idea when someone is "really" just fat, not chubby, if you ever have a doubt. Don't use it as a guide, use it as a factor in your calculations.


## Sex {#sex}

Sex and its meaning is something we should definitely talk about more openly. If it's not on the table, which often means end of dating, so be it. If it is under certain understandings as it often is, it should be discussed. It is a topic that often disappears into a lingering question mark. Some like to call this a tease, but I don't. Teasing, I believe, is something that happens _after_ people are comfortable enough to put sex on the table. Otherwise, why waste feelings and time? Even at times where we're not sure sex will take place (this happens to me often enough), it is fine to say so. Something like "look, I don't want to get your hopes up, I'm just not sure yet. Can we take it easy one more time or two?" is perfectly fine. If it isn't, you'd better go look for someone else. I would.


## Priorities and Specifics {#priorities-and-specifics}


## Mainstream {#mainstream}


## Attraction {#attraction}

Physical attraction is a big factor. I find it funny  how far we go out of our way sometimes not to mention this. It would seem we are so careful not to hurt anyone's feelings, and by doing so we hurt oursevles in the long run.

The fact is, I don't find most of the women who are interested in me online attractive. There's hardly anything new or weird about this statement when you think about, yet, it just sounds so _bad_. Why is that?

I do not think I have high standards. I am not attracted to obese women, though in some cases overwight is OK. I think [WHO's BMI calculations](http://www.who.int/en/news-room/fact-sheets/detail/obesity-and-overweight) is overall a pretty good guide for what I call overweight, if you're curious. I've tried to force myself to date obese and overwight women before and ended up being miserable, or made them misrable as a result. the temption, due to despair, can be overwhelming at times.

Other factors that go into attraction for me include less body hair in general, but I do not have any hard lines here. Smell and hygine are important to me. That's mostly it. It seems the women I date have far stricter requierments in this area, but I wouldn't know for sure. This is not often discussed as I hope it would,  even if I ask directly. My conclusion then is based on what I see on profiles, comments such as "please be fit," or "only groomed beards" and the like. Among the more hidden features (those are the kind that are not posted on the profile or discussed openely, sometimes never) the height issue seems to be a big deal: Most women want their partner to be taller than they are.

I've dated a tall woman once who, after a few months and a couple of sexual intercourses, finally came to the conclusion that the height differene _does_ in fact bothers her. She was somewhat surprised herself, it was a discovery she has made and shared with me. We have developed a friendship strong enough by then to respect one another to admit such things (we still are friends). She mentioned that the real realizion was not the fact that the height difference bothered her; it was the fact that she had _resisted_ acknologing it is such a big deal for so long. She saw herself as accepting and open minded, and having a problem with a height was betraying this image of herself. In other words, she wouldn't allow herself to admint she is not attracted to shorter men.

For calrification, I'm 5'6''. Definitely not the tallest out there, but there are many women my height or lower. This was never a real problem, I'm using it here as an example for a hidden feature as I explained earlier.


## Sex {#sex}

Finally I want to address sex _means_. Most of us date with sex on the mind, to one degree or another. Of course there are asexual folks and those who use dating apps to create stirctly social connections, but in general this is rare. For a long time, I struggeld with the fact of bringing sex up on my profile. I have a somewhat of a BDSM background, and I'm not new to what is generally considered "kinky" sex. What this means, interestingly, is that I often bring sex up as a conversation topic. Because this is a personal and sensitive issue, I would ask a permission first, and naturally, I need to be comfortable myself. This doesn't usually happen on the first date, but it can.

As an average CIS male (whatever average means), it seems I usually crave sex more often then those I date. However, it seems women crave sex just as much but are hold back from bringing it up. This ties to a familiar pattern of what wanting sex means to a woman, or, as a friend of mine would often say when I talk to her, what it still unfortunately means to women to "admit" wanting sex. I strongly agree that we still judge women who openly seek sex too harshly, but for now, this reality means most women won't be comfortable discussing sex opently before we get intimate, which in my opinion, is a disadventage. I should also mention that there are women who offer sex (or sexual connection) right off the bat, basically the equivilant of "dick pictures" just with female parts. In each case this happened to me, the woman is desperate and unattractive - physically or mentally.

When I was more involved in the "kink scene," sex was everywhere, and therefor, it was nowhere. Everyone had nude pictures on their profile and tell you what gets them off if you'd ask (with permission, of course). I found this libarating. I could know how someone would look like under their clothes and thus very simple to get laid if the interest was mutual. Interistingly though, usually there was _less_ of rush to get there.  You both knew what was down there, you both knew you want to get here eventually, so you both ended up getting a drink and talking it over and build something that would _include_ rather than lead to sex.

Unfortnately I since stopped being as active. Partly due to time constraints, but mostly due to age. Many of these groups are strongly enfourced by an age limit that wouldn't allow a man my age to join a group of people in their 20s, for example. This is a good rule, and is there for a good reason. Work is often another thing that gets in the way, especially if you like what you do. It's just not as appealing to be an hour late and show up with a hangover to work. Been there, done that, no thank you kind of deal.

In my opinion, Sex and its meaning is something we should definitely talk about more openly. If it's not on the table, which often means end of dating, so be it. If it is under certain understandings as it often is, it should be discussed. It is a topic that often disappears into a lingering question mark. Some like to call this a tease, but I don't. Teasing, I believe, is something that happens _after_ people are comfortable enough to put sex on the table. Otherwise, why waste feelings and time? Even at times where we're not sure sex will take place (this happens to me often enough), it is fine to say so. Something like "look, I don't want to get your hopes up, I'm just not sure yet. Can we take it easy one more time or two?" is perfectly fine. If it isn't, you'd better go look for someone else. I would.


## Where are we {#where-are-we}

At this point in my life, dating people is at it's hardest. The only time in my life I recall dating being as challanging was my early 20s, where I was still a clueless virgin who tried to do everything "by the book." Life had different plans, as it often does, and I ended up the complete opposite direction which thankfully shocked me out of that stupid daze.

I am a consitant person, and I belive in keeping on trying a forumla that generally works. This is what I intend to keep on doing. One of the things I know I should start doing again though is turning back to the kink scene and find positive people in it. That has been the best becon in the past, and I believe it could once again in the future.